Конфигурация/Documents/ЗачислениеПаев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ЗачислениеПаев</Name>
			<BasedOn>
				<xr:Item>Document.ПереводДенежныхСредств</xr:Item>
				<xr:Item>Document.ЗаявкаПайщика</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ДолиПайщиковВИнвестиционномФонде</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пайщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоступлениеДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПереводДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНадбавки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/InformationRegisters/РеквизитыПИФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РеквизитыПИФ</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УправляющаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УправляющиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КраткоеНаименованиеФонда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолноеНаименованиеФонда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ДолиПайщиковВИнвестиционномФонде.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ДолиПайщиковВИнвестиционномФонде</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодЗаписи</Name>
					<Comment>Дата записи в миллисекундах, для контроля последовательности проведения</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пайщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗачислениеПаев</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ЗадолженностиПоДенежнымСредствам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЗадолженностиПоДенежнымСредствам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеЗадолженностиПоДенежнымСредствам</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ФинансовыеПоказатели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ФинансовыеПоказатели</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубъектАналитики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
						<v8:Type>cfg:CatalogRef.СтратегииИндивидуальногоИнвестирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПоказателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыФинансовыхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/УсловияПравилПаевогоИнвестиционногоФонда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УсловияПравилПаевогоИнвестиционногоФонда</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МинимальнаяСуммаЗачисления</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредназначенДляКвалИнвесторов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокОплатыВознагражденияУК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьВСЧАРезервыЗаВознаграждениеДепозитария</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьВСЧАРезервыЗаВознаграждениеУправляющего</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьВСЧАРезервыЗаПрочиеВозмещаемыеРасходыУправляющего</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьРезервыЗаВознаграждениеДепозитарияВБэкОфисе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьРезервыЗаВознаграждениеУправляющегоВБэкОфисе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьРезервыЗаПрочиеВозмещаемыеРасходыУправляющегоВБэкОфисе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокОплатыПриЧастичномПогашении</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВестиУчетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаРасчетаРезервовЗаВознаграждениеУправляющего</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаРасчетаРезервовЗаВознаграждениеДепозитария</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаРасчетаРезервовЗаПрочиеВозмещаемыеРасходыУправляющего</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантНачалаСрокаОплатыВознагражденияУК</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНачалаСрока</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименяютсяНадбавкиИСкидкиПриЗачисленииИПогашенииПаев</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаРасчетаНадбавкиПриПриобретенииПаев</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаРасчетаСкидкиПриПогашенииПаев</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыЗаявокПайщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыЗаявокПайщиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зачисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Погашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обмен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/ЗачислениеПаев/Ext/ObjectModule.bsl
Процедура ПроведениеПоРегиструБухгалтерии(УчетныйРегистр, Отказ) Экспорт

	НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчета(
		ЭтотОбъект.Дата,
		ЭтотОбъект.Организация,
		ЭтотОбъект.СчетДоверительногоУправления);
	
	
	Движения[УчетныйРегистр].Записывать = Истина;
	
	Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], Сумма - СуммаНадбавки, "Зачисление паев");
	
	Проводка.СчетДт = Планысчетов.Основной.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами;
	Проводка.СубконтоДт.Контрагенты = РаботаСДокументами.ПолучитьКонтрагентаПоВидуПайщика(Заявка.ВидПайщика, Заявка.Владелец, Пайщик, Дата);	
	
	Проводка.СчетКт = Планысчетов.Основной.ЦелевоеФинансированиеИзБюджета;
	Проводка.СубконтоКт.Контрагенты = Пайщик;
	
	Проводка.КоличествоКт = Количество;
	
	Если ЭтотОбъект.СуммаНадбавки > 0 Тогда
		
		РеквизитыПИФ = РегистрыСведений.РеквизитыПИФ.ПолучитьРеквизитыПИФ(ЭтотОбъект.ПаевойИнвестиционныйФонд, ЭтотОбъект.Дата);
		УправляющаяКомпания = РеквизитыПИФ.УправляющаяКомпания;
		УправляющаяКомпанияЮрФизЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УправляющаяКомпания, "ЮрФизЛицо");
		
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], СуммаНадбавки, "Надбавка при покупке паев");
		
		Проводка.СчетДт = Планысчетов.Основной.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами;
		Проводка.СубконтоДт.Контрагенты = РаботаСДокументами.ПолучитьКонтрагентаПоВидуПайщика(Заявка.ВидПайщика, Заявка.Владелец, Пайщик, Дата);	
		
		Проводка.СчетКт = Планысчетов.Основной.РасчетыСПрочимиПоставщикамиИПодрядчиками;
		Проводка.СубконтоКт.Контрагенты = УправляющаяКомпанияЮрФизЛицо;

		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], СуммаНадбавки, "Перечислена надбавка в УК");
		
		Проводка.СчетДт = Планысчетов.Основной.РасчетыСПрочимиПоставщикамиИПодрядчиками;
		Проводка.СубконтоДт.Контрагенты = УправляющаяКомпанияЮрФизЛицо;

		Проводка.СчетКт = Планысчетов.Основной.РасчетныеСчета;
		Проводка.СубконтоКт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.НадбавкаПриПокупкеПаев;
		Проводка.СубконтоКт.БанковскиеСчета = ЭтотОбъект.ПоступлениеДенежныхСредств.РасчетныйСчетПолучатель;
		
	КонецЕсли;
	
	Если НастройкиУчета.ВестиУчетИмуществаПайщиков Тогда
	
		ПроводкаПайщика = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], Сумма - СуммаНадбавки, "Зачисление паев пайщику");
		
		ПроводкаПайщика.СчетДт = Планысчетов.Основной.ПаиПайщиков;
		ПроводкаПайщика.СубконтоДт.Пайщики = Пайщик;
		ПроводкаПайщика.СубконтоДт.ОснованиеРасчетовПоПайщикам = ЭтотОбъект.Ссылка;
		ПроводкаПайщика.КоличествоДт = Количество;

		ПроводкаПайщика.СчетКт = ПланыСчетов.Основной.РасчетыКлиентаСПИФ;
		ПроводкаПайщика.СубконтоКт.Пайщики = Пайщик;
		ПроводкаПайщика.СубконтоКт.ЗаявкиПайщиков = ЭтотОбъект.Заявка;
		
		
		ПроводкаПайщика = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], СуммаНадбавки, "Надбавка при покупке паев");
		
		ПроводкаПайщика.СчетДт = Планысчетов.Основной.НадбавкаПриПокупкеПаев;
		ПроводкаПайщика.СубконтоДт.Пайщики = Пайщик;
		ПроводкаПайщика.СубконтоДт.ОснованиеРасчетовПоПайщикам = ЭтотОбъект.Ссылка;

		ПроводкаПайщика.СчетКт = ПланыСчетов.Основной.РасчетыКлиентаСПИФ;
		ПроводкаПайщика.СубконтоКт.Пайщики = Пайщик;
		ПроводкаПайщика.СубконтоКт.ЗаявкиПайщиков = ЭтотОбъект.Заявка;
		
	КонецЕсли;
	
КонецПроцедуры // ПроведениеПоРегиструБухгалтерии

Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	РаботаСРегистрамиНакопления.ОчиститьДвиженияПоБэкофису(ЭтотОбъект);
	
	ДвиженияПоРегиструДолиПайщиков(Отказ);
	ДвиженияПоЗадолженностиПоДенежнымСредствам(Отказ);
	
	Движения.Записать();
	
	РаботаСРегистрамиНакопления.ПроверитьОтрицательныеОстаткиЗадолженностиПоДенежнымСведствам(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ПроведениеПоРегистрамБэкОфиса

Процедура ДвиженияПоРегиструДолиПайщиков(Отказ)
	
	Движения.ДолиПайщиковВИнвестиционномФонде.Записывать = Истина;
	
	Движение = Движения.ДолиПайщиковВИнвестиционномФонде.ДобавитьПриход();
	
	Движение.Период      = Дата;
	Движение.Организация = Организация;
	Движение.Пайщик      = Пайщик;
	Движение.Партия      = Ссылка;
	
	Движение.ПаевойИнвестиционныйФонд = ПаевойИнвестиционныйФонд;
	
	Движение.Количество  = Количество;
	Движение.Стоимость	 = Сумма;
	
КонецПроцедуры

Процедура ДвиженияПоЗадолженностиПоДенежнымСредствам(Отказ)
	
	Движения.ЗадолженностиПоДенежнымСредствам.Записывать = Истина;
	
	РеквизитыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, "ВалютаУчета, ЮрФизЛицо");
	
	ЭтоЗачислениеПаевПоОбмену = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Заявка, "ВидЗаявки") = Перечисления.ВидыЗаявокПайщиков.Обмен;

	// При зачислении по обмену ввод денежных средств будет позже, получаем дебиторскую задолженность
	Если ЭтоЗачислениеПаевПоОбмену Тогда		
		Движение 					= Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьПриход();
		Движение.ТипЗадолженности	= Перечисления.ТипыЗадолженности.Дебиторская;
		Движение.Аванс				= Ложь;		
	Иначе		
		Движение					= Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьРасход();
		Движение.ТипЗадолженности	= Перечисления.ТипыЗадолженности.Кредиторская;
		Движение.Аванс				= Истина;		
	КонецЕсли;
	
	Движение.Период							= Дата;	
	Движение.Основание						= Заявка;	
	Движение.ВидЗадолженности				= Справочники.ВидыЗадолженности.ПередПайщиками;
	Движение.Организация					= Организация;
	Движение.СчетДоверительногоУправления	= СчетДоверительногоУправления;
	Движение.Контрагент						= Пайщик;
	Движение.Валюта							= РеквизитыОрганизации.ВалютаУчета;	
	Движение.Сумма							= Сумма;
	
	Если ЭтотОбъект.СуммаНадбавки > 0 Тогда
		
		Движение = Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьПриход();
	
		Движение.Период 						= Дата;		
		Движение.Основание 						= Ссылка;
		Движение.ТипЗадолженности 				= Перечисления.ТипыЗадолженности.Кредиторская;
		Движение.ВидЗадолженности 				= Справочники.ВидыЗадолженности.УдержаниеНадбавокПИФ;
		Движение.Организация      				= Организация;
		Движение.СчетДоверительногоУправления 	= СчетДоверительногоУправления;
		Движение.Контрагент 					= РеквизитыОрганизации.ЮрФизЛицо;
		Движение.Валюта 						= РеквизитыОрганизации.ВалютаУчета;				
		Движение.Сумма 							= СуммаНадбавки;
	
	КонецЕсли;	
	
КонецПроцедуры

#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);	
	ЭтотОбъект.СчетДоверительногоУправления = Справочники.СчетаДоверительногоУправления.СчетДоверительногоУправленияКлиента(ПаевойИнвестиционныйФонд);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПереводДенежныхСредств") 
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаПайщика") Тогда
		
		ЭтотОбъект.Дата							= НачалоДня(ТекущаяДатаСеанса());
		ЭтотОбъект.Организация					= ДанныеЗаполнения.Организация;
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПереводДенежныхСредств") Тогда
			ЭтотОбъект.СчетДоверительногоУправления	= ДанныеЗаполнения.СчетДоверительногоУправления;
			ЭтотОбъект.ПаевойИнвестиционныйФонд 	= Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(СчетДоверительногоУправления, ДанныеЗаполнения.Дата);
			ЭтотОбъект.ПоступлениеДенежныхСредств	= ДанныеЗаполнения;
			ЭтотОбъект.Заявка						= ДанныеЗаполнения.Основание;
		Иначе
			ЭтотОбъект.ПаевойИнвестиционныйФонд 	= ?(ДанныеЗаполнения.ВидЗаявки = Перечисления.ВидыЗаявокПайщиков.Обмен,
												ДанныеЗаполнения.ПаевойИнвестиционныйФондДляОбменаПаев, 
												ДанныеЗаполнения.ПаевойИнвестиционныйФонд);
												
			ЭтотОбъект.СчетДоверительногоУправления = Справочники.СчетаДоверительногоУправления.СчетДоверительногоУправленияКлиента(ЭтотОбъект.ПаевойИнвестиционныйФонд);
			ЭтотОбъект.Заявка						= ДанныеЗаполнения.Ссылка;
		КонецЕсли;
		
		РеквизитыЗаявки 	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭтотОбъект.Заявка, "Пайщик, Многократная, ИсточникЗаявки");
		
		ЭтотОбъект.Пайщик							= РеквизитыЗаявки.Пайщик;
		
		Если РеквизитыЗаявки.Многократная 
			И ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПереводДенежныхСредств") Тогда
			ЭтотОбъект.Сумма = ДанныеЗаполнения.Сумма;
		Иначе
			ЭтотОбъект.Сумма = ПолучитьСуммуЗадолженностиПоЗаявке();
		КонецЕсли;
		
		Если ДанныеЗаполнения.РасчетныйСчет.ТранзитныйПИФ
			И ЗначениеЗаполнено(ДанныеЗаполнения.Основание)
			ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаПайщика") Тогда
			
			Основание = "Уведомление об операции по ЛС";
			
			РасчетнаяСтоимостьПая = РегистрыСведений.ФинансовыеПоказатели.РасчетнаяСтоимостьПаяНаДату(
								Организация,
								СчетДоверительногоУправления,
								Справочники.НастройкиРегламентныхДействий.ПолучитьДатуПредыдущегоРасчетаСЧА(
									СчетДоверительногоУправления,						
									Дата));
									
			Если РасчетнаяСтоимостьПая <> Неопределено Тогда
				
				ПараметрыНадбавки	= РегистрыСведений.УсловияПравилПаевогоИнвестиционногоФонда.ПараметрыРасчетаНадбавокИСкидок(ЭтотОбъект.ПаевойИнвестиционныйФонд, ЭтотОбъект.Дата);
				
				НадбавкаИКоличество = РаботаСДокументамиКлиентСервер.РассчитатьКоличествоПаевИСуммуНадбавки(ЭтотОбъект.Сумма, РасчетнаяСтоимостьПая, ПараметрыНадбавки);
				
				// Округления на каждом этапе
				ЭтотОбъект.Количество		= НадбавкаИКоличество.Количество;				
				ЭтотОбъект.СуммаНадбавки	= НадбавкаИКоличество.СуммаНадбавки;
																
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;  
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);

	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	// Проверка уникальности перевода
	Если ЗначениеЗаполнено(ПоступлениеДенежныхСредств) Тогда
		
		Блокировка = Новый БлокировкаДанных;
		
		ЭлементБлокировки = Блокировка.Добавить("Документ.ЗачислениеПаев");
		ЭлементБлокировки.УстановитьЗначение("ПоступлениеДенежныхСредств", ПоступлениеДенежныхСредств);
		
		Блокировка.Заблокировать();
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗачислениеПаев.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗачислениеПаев КАК ЗачислениеПаев
		|ГДЕ
		|	ЗачислениеПаев.ПоступлениеДенежныхСредств = &ПоступлениеДенежныхСредств
		|	И ЗачислениеПаев.Проведен
		|	И ЗачислениеПаев.Организация = &Организация
		|	И ЗачислениеПаев.Ссылка <> &Ссылка");
		
		Запрос.УстановитьПараметр("ПоступлениеДенежныхСредств", ПоступлениеДенежныхСредств);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		МассивЗачислений = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
		
		Если МассивЗачислений.Количество() Тогда
			СтрокаСообщения = "По документу " + ПоступлениеДенежныхСредств + " уже введено зачисление " + СтрСоединить(МассивЗачислений, ", ");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаСообщения, Ссылка, "ПоступлениеДенежныхСредств", "Объект", Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Не Отказ Тогда
		РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);
				
	РаботаСДокументами.СформироватьПроводки(ЭтотОбъект, Отказ);
		
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция ПолучитьСуммуЗадолженностиПоЗаявке()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
		|			&МоментВремени,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПередПайщиками)
		|				И Основание = &ЗаявкаПайщика
		|				И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)) КАК ЗадолженностиПоДенежнымСредствамОстатки";
	
	Запрос.УстановитьПараметр("ЗаявкаПайщика", ЭтотОбъект.Заявка);
	Запрос.УстановитьПараметр("МоментВремени", ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.СуммаОстаток;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции
